/*******************************************************************************
 *   Filename:      app.c
 *   Revised:       $Date: 2013-06-30$
 *   Revision:      $
 *	 Writer:		Wuming Shen.
 *
 *   Description:
 *   Notes:
 *					QQ:276193028
 *     				E-mail:shenchangwei945@163.com
 *
 *   All copyrights reserved to Wuming Shen.
 *
 *******************************************************************************/

/*******************************************************************************
 * INCLUDES
 */
#define  SNL_APP_SOURCE
#include <app.h>
#include <iap.h>

#ifdef VSC_INCLUDE_SOURCE_FILE_NAMES
const  CPU_CHAR  *main__c = "$Id: $";
#endif

/*******************************************************************************
 * CONSTANTS
 */
#define CYCLE_TIME_TICKS            (OS_TICKS_PER_SEC * 2)

/*******************************************************************************
 * MACROS
 */

/*******************************************************************************
 * TYPEDEFS
 */

/*******************************************************************************
 * LOCAL VARIABLES
 */

/*******************************************************************************
 * GLOBAL VARIABLES
 */

/*******************************************************************************
 * LOCAL FUNCTIONS
 *
 * 返回类型         函数名称                入口参数
 */

/*******************************************************************************
 * GLOBAL FUNCTIONS
 */

/*******************************************************************************
 * EXTERN VARIABLES
 */

/*******************************************************************************
 * EXTERN FUNCTIONS
 */

/*******************************************************************************
 * 名    称： App_Main
 * 功    能： 系统初开始前调用此函数
 * 入口参数： 无
 * 出口参数： 无
 * 作　 　者： 无名沈
 * 创建日期： 2014-08-08
 * 修    改：
 * 修改日期：
 *******************************************************************************/
 void App_Main(void)
 {
    /***********************************************
    * 描述： Disable all interrupts.
    */
    BSP_IntDisAll();
    /***********************************************
    * 描述： 重新设置应用程序中断向量表，如果没有BOOTLOADER
    *        NVIC_VectTab_FLASH_OFFSET = 0
    */
#if defined     (IMAGE_A)
    /***********************************************
    * 描述： 程序A
    */
    NVIC_SetVectorTable(NVIC_VectTab_FLASH, FLASH_APP_ADDR_A-FLASH_BOOT_ADDR);
    //IAP_JumpToApp();    
    IAP_SetStatus(IAP_STS_SUCCEED); 
#elif defined   (IMAGE_B)
    /***********************************************
    * 描述： 程序B
    */
    NVIC_SetVectorTable(NVIC_VectTab_FLASH, FLASH_APP_ADDR_B-FLASH_BOOT_ADDR);
    //IAP_JumpToApp();
    IAP_SetStatus(IAP_STS_SUCCEED); 
#else
    /***********************************************
    * 描述： 程序
    */
    NVIC_SetVectorTable(NVIC_VectTab_FLASH, 0X0000);
#endif
 
 }

/*******************************************************************************
 * 名    称： App_InitStartHook
 * 功    能： 系统初始化开始前调用此函数
 * 入口参数： 无
 * 出口参数： 无
 * 作　 　者： 无名沈
 * 创建日期： 2014-08-08
 * 修    改：
 * 修改日期：
 *******************************************************************************/
 void App_InitStartHook(void)
 {
 
 }
 
/*******************************************************************************
 * 名    称： App_InitEndHook
 * 功    能： 系统初始化结速后调用此函数
 * 入口参数： 无
 * 出口参数： 无
 * 作　 　者： 无名沈
 * 创建日期： 2014-08-08
 * 修    改：
 * 修改日期：
 *******************************************************************************/
 void App_InitEndHook(void)
 {
 
 }
 
 /*******************************************************************************
 * 名    称： OSAL_TaskCreateHook
 * 功    能： OSAL创建任务回调函数
 * 入口参数： 无
 * 出口参数： 无
 * 作　 　者： 无名沈
 * 创建日期： 2014-08-08
 * 修    改：
 * 修改日期：
 *******************************************************************************/
 void OSAL_TaskCreateHook(void)
 {
 
    //osal_add_Task(TaskInitKey,                      // 任务初始化函数指针
    //              TaskKeyEvtProcess,                // 任务事件处理函数指针
    //              OS_TASK_PRO_KEY,                  // 任务优先级
    //              OS_TASK_ID_KEY);                  // 任务ID
    
    //osal_add_Task(TaskInitCtrl,                     // 任务初始化函数指针
    //              TaskCtrlEvtProcess,               // 任务事件处理函数指针
    //              OS_TASK_PRO_CTRL,                 // 任务优先级
    //              OS_TASK_ID_CTRL);                 // 任务ID
    
    osal_add_Task(TaskInitSen,                      // 任务初始化函数指针
                  TaskSenEvtProcess,                // 任务事件处理函数指针
                  OS_TASK_PRO_SEN,                  // 任务优先级
                  OS_TASK_ID_SEN);                  // 任务ID
    
    osal_add_Task(TaskInitDisp,                     // 任务初始化函数指针
                  TaskDispEvtProcess,               // 任务事件处理函数指针
                  OS_TASK_PRO_DISP,                 // 任务优先级
                  OS_TASK_ID_DISP);                 // 任务ID 
 }
/*******************************************************************************
 *              end of file                                                    *
 *******************************************************************************/
