/*******************************************************************************
 *   Filename:       Uart.c
 *   Revised:        $Date: 2009-01-31	20:15 (Fri) $
 *   Revision:       $
 *	 Writer:		 Wuming Shen.
 *
 *   Description:    用TMR1延时中断，通过RB0输出脉冲，每隔100MS让LED闪亮，采用中断方式
            若定时器TMR1延时100MS,8位pic单片机晶振4MHZ，则指令周期Tcy=1us，计算如下：
            1.设预分频比为K，则65536*K*Tcy=100_000us，得K=1.52，要取大于此值的最小分频比，即K=2
            2.计算延时常数X,（65536-cnts）*2*Tcy=100_000us，四舍五入取整，得X=15536. cnts = 65536 - ( 1000 / TICKS_PER_SEC / TIMER1_CLK_DIV )
 *
 *   Notes:        
 *					   
 *			
 *   All copyrights reserved to Wuming Shen.  现代虚拟仪器仪表研究所
 *
 *******************************************************************************/

/*******************************************************************************
 * INCLUDES
 */
#include <global.h>
#include <includes.h>

#include "osal_event.h"
#include "osal_timer.h"
   
#define BSP_TIMER_MODULE_EN 1   
#if BSP_TIMER_MODULE_EN > 0
/*******************************************************************************
 * CONSTANTS
 */

/*******************************************************************************
 * MACROS
 */

/*******************************************************************************
 * TYPEDEFS
 */

/*******************************************************************************
 * LOCAL VARIABLES
 */

/*******************************************************************************
 * GLOBAL VARIABLES
 */

/*******************************************************************************
 * LOCAL FUNCTIONS
 */
void        osal_timer_isr      (void);

/*******************************************************************************
 * GLOBAL FUNCTIONS
 */

/*******************************************************************************
 * EXTERN VARIABLES
 */

 /*******************************************************************************
 * EXTERN FUNCTIONS
 */
 
/******************************************************************************
 * @fn
 *
 * @brief   TIMER_INT interrupt take string
 *
 * @param
 *
 * @return
 *****************************************************************************/
void osal_timer_isr(void )
{
    /***********************************************
    * 描述：时间计算
    *
    HAL_STimerPoll();                               // 秒定时器更新

    if ( ++SysTime.msec > ( TICKS_PER_SEC - 1 ) ) {    // 1秒钟计满
        SysTime.msec   = 0;
        HAL_MTimerPoll();                           // 分定时器更新
        
        if ( ++SysTime.sec > 59 ) {                    // 1分钟计满
            SysTime.sec    = 0;
            HAL_HTimerPoll();                       // 时定时器更新
            
            if ( ++SysTime.min > 59 ) {                // 1小时计满
                SysTime.min    = 0;
                if ( ++SysTime.hour > 23 ) {           // 1天计满
                    SysTime.hour   = 0;
                }
            }
        }
    }
    *//***********************************************
    * 描述：osal_timer_isr
    */
    osal_update_timers();
}

/*******************************************************************************
 * 				end of file                                    *
 *******************************************************************************/ 
#endif