/******************** (C) COPYRIGHT 2013 www.armjishu.com  ********************
 * 文件名  ：SPI_CS5463_DC.h
 * 描述    ：实现CS5463底层函数
 * 标准库  ：STM32F10x_StdPeriph_Driver V3.5.0
 * 作者    ：ZW
*******************************************************************************/

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __SPI_CS5463_DC_H
#define __SPI_CS5463_DC_H

/* Includes ------------------------------------------------------------------*/
#include "stm32f10x.h"
#include "stm32f10x_spi.h"

/**-----------------------------------------------------------------
  * @函数名 SPI_DC_INIT
  * @功能   初始化与CS5463接口的驱动函数
  * @参数   无
  * @返回值 无
***----------------------------------------------------------------*/
extern void SPI_DC_INIT(void);

/**-----------------------------------------------------------------
  * @函数名 CS5463_DC_INIT
  * @功能   CS5463初始化
  *         
  * @参数   无
  * @返回值 无
***----------------------------------------------------------------*/
extern void CS5463_DC_INIT(void);

/**-----------------------------------------------------------------
  * @函数名 CS5463_DC_Adjust
  * @功能   CS5463校准
  *         
  * @参数   无
  * @返回值 无
***----------------------------------------------------------------*/
extern void CS5463_DC_Adjust(void);	

/**-----------------------------------------------------------------
  * @函数名 SPI_CS5463_DC_SendByte
  * @功能   通过SPI总线发送一个字节数据(同时接收一个字节数据)
  *         Sends a byte through the SPI interface and return the byte
  *         received from the SPI bus.
  * @参数   要写入的一个字节数据
  * @返回值 在发数据时，MISO信号线上接收的一个字节
***----------------------------------------------------------------*/
extern uint8_t SPI_CS5463_DC_SendByte(uint8_t byte);

/**-----------------------------------------------------------------
  * @函数名 SPI_CS5463_DC_ReadByte
  * @功能   读取CS5463的一个字节，未包含发送读命令和起始地址
  * @参数   无
  * @返回值 从CS5463读取的一个字节
***----------------------------------------------------------------*/
extern uint8_t SPI_CS5463_DC_ReadByte(void);

/**-----------------------------------------------------------------
  * @函数名 SPI_CS5463_DC_SendCommand
  * @功能   通过SPI总线发送一个字节命令
  *         Sends a byte through the SPI interface
  * @参数   要写入的一个字节命令
  * @返回值 无
***----------------------------------------------------------------*/
extern void SPI_CS5463_DC_SendCommand(uint8_t Command);

/**-----------------------------------------------------------------
  * @函数名 SPI_CS5463_DC_Write
  * @功能   往CS5463中写任意长度数据
  * @参数   *buf 数组，len 数组长度(以字节为最小单位)
***----------------------------------------------------------------*/
extern void SPI_CS5463_DC_Write(uint8_t *buf , uint8_t len);

/**-----------------------------------------------------------------
  * @函数名 SPI_CS5463_DC_WriteRegister
  * @功能   写CS5463的寄存器
  * @参数   Command为命令，DATA为数据
***----------------------------------------------------------------*/
extern void SPI_CS5463_DC_WriteRegister(uint8_t Command , uint32_t DATA);

/**-----------------------------------------------------------------
  * @函数名 SPI_CS5463_DC_Read
  * @功能   读取CS5463的寄存器
  * @参数   Command：单字节命令,buf为读取到的数组
***----------------------------------------------------------------*/
extern void SPI_CS5463_DC_Read(uint8_t Command , uint8_t *buf);

/**-----------------------------------------------------------------
  * @函数名 SPI_CS5463_DC_ReadRegister_INT32
  * @功能   读取CS5463的寄存器，得到1个3字节数据
  * @参数   Command：单字节命令
  * @返回   Data，3字节数据
***----------------------------------------------------------------*/
extern uint32_t SPI_CS5463_DC_ReadRegister_INT32(uint8_t Command);

/**-----------------------------------------------------------------
  * @函数名 SPI_CS5463_DC_Read_Temp_FLOAT
  * @功能   读取CS5463的寄存器，得到1个浮点型数据
  * @参数   Command：单字节命令
  * @返回   Data，浮点型数据
  * @备注   返回的的字节为-2^7,2^6到2^-16
***----------------------------------------------------------------*/
extern float SPI_CS5463_DC_Read_Temp_FLOAT(uint8_t Command);

/**-----------------------------------------------------------------
  * @函数名 SPI_CS5463_DC_Read_VIrms_FLOAT
  * @功能   读取CS5463的电压/电流有效值，得到1个浮点型数据
  * @参数   Command：单字节命令
  * @返回   Data，浮点型数据				  
  * @备注   返回的的字节为2^-1到2^-24
***----------------------------------------------------------------*/
extern float SPI_CS5463_DC_Read_VIrms_FLOAT(uint8_t Command);

/**-----------------------------------------------------------------
  * @函数名 SPI_CS5463_DC_Read_VIgain_FLOAT
  * @功能   读取CS5463的电压/电流增益，得到1个浮点型数据
  * @参数   Command：单字节命令
  * @返回   Data，浮点型数据
  * @备注   返回的的字节为2^1到2^0 + 2^-1到2^-22 (2^1到2^-22)
***----------------------------------------------------------------*/
extern float SPI_CS5463_DC_Read_VIgain_FLOAT(uint8_t Command);

/**-----------------------------------------------------------------
  * @函数名 SPI_CS5463_DC_Read_Else_FLOAT
  * @功能   读取CS5463的电压电流DC偏移，得到1个浮点型数据
  * @参数   Command：单字节命令
  * @返回   Data，浮点型数据
  * @备注   返回的的字节为2^-1到2^-23，再加上最高位负值-2^0
***----------------------------------------------------------------*/
extern float SPI_CS5463_DC_Read_Else_FLOAT(uint8_t Command);

/**-----------------------------------------------------------------
  * @函数名 SPI_CS5463_DC_ClearDrdy
  * @功能   CS5463进入清除数据就绪状态位
  * @参数   无
  * @返回值 无
***----------------------------------------------------------------*/
extern void SPI_CS5463_DC_ClearDrdy(void);

/**-----------------------------------------------------------------
  * @函数名 SPI_CS5463_DC_WaitDrdy
  * @功能   CS5463等待数据就绪状态位
  * @参数   无
  * @返回值 无
***----------------------------------------------------------------*/
extern void SPI_CS5463_DC_WaitDrdy(void);

/**-----------------------------------------------------------------
  * @函数名 SPI_SPI_CS5463_DC_SLEEP
  * @功能   CS5463进入睡眠模式
  * @参数   无
  * @返回值 无
***----------------------------------------------------------------*/
extern void SPI_CS5463_DC_SLEEP(void);     

/**-----------------------------------------------------------------
  * @函数名 SPI_SPI_CS5463_DC_Wait
  * @功能   CS5463进入等待模式
  * @参数   无
  * @返回值 无
***----------------------------------------------------------------*/
extern void SPI_CS5463_DC_WAIT(void);   

/**-----------------------------------------------------------------
  * @函数名 SPI_CS5463_DC_SOFT_RESET
  * @功能   软件复位CS5463
  * @参数   无
  * @返回值 无
***----------------------------------------------------------------*/
extern void SPI_CS5463_DC_SOFT_RESET(void);
 

#endif /* __SPI_CS5463_DC_H */

/******************* (C) COPYRIGHT 2010 www.armjishu.com *****END OF FILE****/
