/******************** (C) COPYRIGHT 2014 www.nanche.com  ********************
 * 文件名  ：SPI_CS5463_AC.h
 * 描述    ：实现CS5463底层函数
 * 标准库  ：STM32F10x_StdPeriph_Driver V3.5.0
 * 作者    ：ZW
*******************************************************************************/

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __SPI_CS5463_AC_H
#define __SPI_CS5463_AC_H

/* Includes ------------------------------------------------------------------*/
#include "stm32f10x.h"
#include "stm32f10x_spi.h"

/* Exported types ------------------------------------------------------------*/
/* Exported constants --------------------------------------------------------*/

void SPI_AC_INIT(void);

/**-----------------------------------------------------------------
  * @函数名 CS5463_AC_INIT
  * @功能   CS5463初始化
  *         
  * @参数   无
  * @返回值 无
***----------------------------------------------------------------*/
void CS5463_AC_INIT(void);

/**-----------------------------------------------------------------
  * @函数名 SPI_CS5463_AC_SendByte
  * @功能   通过SPI总线发送一个字节数据(同时接收一个字节数据)
  *         Sends a byte through the SPI interface and return the byte
  *         received from the SPI bus.
  * @参数   要写入的一个字节数据
  * @返回值 在发数据时，MISO信号线上接收的一个字节
***----------------------------------------------------------------*/

//void CS5463_AC_Adjust(MODBUS_CH  *pch,uint8_t mode)	;

void SPI_CS5463_AC_SendByte(uint8_t byte);

/**-----------------------------------------------------------------
  * @函数名 SPI_CS5463_AC_ReadByte
  * @功能   读取CS5463的一个字节，未包含发送读命令和起始地址
  * @参数   无
  * @返回值 从CS5463读取的一个字节
***----------------------------------------------------------------*/
uint8_t SPI_CS5463_AC_ReadByte(uint8_t Command);

/**-----------------------------------------------------------------
  * @函数名 SPI_CS5463_AC_Write
  * @功能   往CS5463中写任意长度数据
  * @参数   *buf 数组，len 数组长度(以字节为最小单位)
***----------------------------------------------------------------*/
void SPI_CS5463_AC_Write(uint8_t *buf , uint8_t len);

/**-----------------------------------------------------------------
  * @函数名 SPI_CS5463_WriteRegister
  * @功能   写CS5463的寄存器
  * @参数   Command为命令，DATA为数据
***----------------------------------------------------------------*/
void SPI_CS5463_AC_WriteRegister(uint8_t Command , uint32_t DATA);

/**-----------------------------------------------------------------
  * @函数名 SPI_CS5463_AC_ReadRegister
  * @功能   读取CS5463的寄存器
  * @参数   Command：单字节命令,buf为读取到的数组
***----------------------------------------------------------------*/
void SPI_CS5463_AC_Read(uint8_t Command , uint8_t *buf);

/**-----------------------------------------------------------------
  * @函数名 SPI_CS5463_AC_ReadRegister_INT32
  * @功能   读取CS5463的寄存器，得到1个3字节数据
  * @参数   Command：单字节命令
  * @返回   Data，3字节数据
***----------------------------------------------------------------*/
uint32_t SPI_CS5463_AC_ReadRegister_INT32(uint8_t Command);

/**-----------------------------------------------------------------
  * @函数名 SPI_CS5463_AC_Read_Temp_FLOAT
  * @功能   读取CS5463的寄存器，得到1个浮点型数据
  * @参数   Command：单字节命令
  * @返回   Data，浮点型数据
***----------------------------------------------------------------*/
float SPI_CS5463_AC_Read_Temp_FLOAT(uint8_t Command);

/**-----------------------------------------------------------------
  * @函数名 SPI_CS5463_AC_Read_VIrms_FLOAT
  * @功能   读取CS5463的电压/电流有效值，得到1个浮点型数据
  * @参数   Command：单字节命令
  * @返回   Data，浮点型数据
  * @备注   返回的的字节为2^-1到2^-24）
***----------------------------------------------------------------*/
float SPI_CS5463_AC_Read_VIrms_FLOAT(uint8_t Command);

/**-----------------------------------------------------------------
  * @函数名 SPI_CS5463_AC_Read_VIgain_FLOAT
  * @功能   读取CS5463的电压/电流增益，得到1个浮点型数据
  * @参数   Command：单字节命令
  * @返回   Data，浮点型数据
  * @备注   返回的的字节为2^1到2^-22  （0-3.9999）
***----------------------------------------------------------------*/
float SPI_CS5463_AC_Read_VIgain_FLOAT(uint8_t Command);

/**-----------------------------------------------------------------
  * @函数名 SPI_CS5463_AC_Read_Else_FLOAT
  * @功能   读取CS5463的电压电流DC偏移，得到1个浮点型数据
  * @参数   Command：单字节命令
  * @返回   Data，浮点型数据
  * @备注   返回的的字节为2^-1到2^-23，再加上最高位负值-2^0
***----------------------------------------------------------------*/
float SPI_CS5463_AC_Read_Else_FLOAT(uint8_t Command);

/**-----------------------------------------------------------------
  * @函数名 SPI_CS5463_AC_SendCommand
  * @功能   通过SPI总线发送一个字节命令
  *         Sends a byte through the SPI interface
  * @参数   要写入的一个字节命令
  * @返回值 无
***----------------------------------------------------------------*/
void SPI_CS5463_AC_SendCommand(u8 Command);

/**-----------------------------------------------------------------
  * @函数名 SPI_CS5463_AC_ClearDrdy
  * @功能   CS5463进入清除数据就绪状态位
  * @参数   无
  * @返回值 无
***----------------------------------------------------------------*/
void SPI_CS5463_AC_ClearDrdy(void);

/**-----------------------------------------------------------------
  * @函数名 SPI_SPI_CS5463_AC_SLEEP
  * @功能   CS5463进入睡眠模式
  * @参数   无
  * @返回值 无
***----------------------------------------------------------------*/

void SPI_CS5463_AC_WaitDrdy(void);

void SPI_CS5463_AC_SLEEP(void);   

/**-----------------------------------------------------------------
  * @函数名 SPI_SPI_CS5463_AC_Wait
  * @功能   CS5463进入等待模式
  * @参数   无
  * @返回值 无
***----------------------------------------------------------------*/
void SPI_CS5463_AC_WAIT(void);   

/**-----------------------------------------------------------------
  * @函数名 SPI_CS5463_AC_SOFT_RESET
  * @功能   软件复位CS5463
  * @参数   无
  * @返回值 无
***----------------------------------------------------------------*/
void SPI_CS5463_AC_SOFT_RESET(void);  


uint8_t SPI_CS5463_AC_GetDrdy(void);

#endif /* __SPI_CS5463_AC_H */

/******************* (C) COPYRIGHT 2010 www.armjishu.com *****END OF FILE****/
